benchmarks/tracking/openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| Carrier velocity. This uniform placeholder is overwritten by set_U.py, which |
| writes the uniform / ramp / uniform streamwise profile (12 -> 4 m/s) that    |
| matches the lptlib verification field. The field is frozen (not solved).     |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (12 0 0);

boundaryField
{
    inlet     { type fixedValue; value uniform (12 0 0); }
    outlet    { type zeroGradient; }
    walls     { type zeroGradient; }
    frontBack { type empty; }
}
