benchmarks/tracking/openfoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| Kinematic pressure (not solved here, present for solver bookkeeping).         |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object p; }

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet     { type zeroGradient; }
    outlet    { type fixedValue; value uniform 0; }
    walls     { type zeroGradient; }
    frontBack { type empty; }
}
