benchmarks/tracking/openfoam/constant/g
FoamFile { version 2.0; format ascii; class uniformDimensionedVectorField; object g; }

// No gravity: the verification isolates drag relaxation.
dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);
