benchmarks/tracking/openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Matched to the lptlib tracking verification field:                          |
|   box 0..5e-4 (x) by 0..6e-5 (y) by 0..6e-5 (z), 500 x 4 x 4 hex cells,     |
|   the same streamwise resolution as the PLOT3D ramp grid.                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

scale 1;

vertices
(
    (0      0      0)
    (5e-4   0      0)
    (5e-4   6e-5   0)
    (0      6e-5   0)
    (0      0      6e-5)
    (5e-4   0      6e-5)
    (5e-4   6e-5   6e-5)
    (0      6e-5   6e-5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 4 4) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet   { type patch;  faces ((0 4 7 3)); }
    outlet  { type patch;  faces ((1 2 6 5)); }
    walls   { type wall;   faces ((0 1 5 4) (3 7 6 2)); }
    frontBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);

mergePatchPairs ();
